Repository: loginom/loginom-help-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: В ответе сервиса все поля публикуются как обязательные.
en: All fields are published as the required ones in the service response.

source: В отдельных вариантах порог дисперсии может достигать 85-90%.
en: In some cases, the variance threshold can reach 85-90%.

source: В отличие от компонента Выполнение узла Узел-ссылка не принимает входные данные и может применяться только в качестве источника данных из других узлов.
en: As opposed to the Node execution component, the Reference node component does not accept input data, and it can be used only as source of the data from other nodes.

source: В отличии от серверных вариантов поставки (Team, Standard, Enterprise) настольные версии (Community, Personal) имеют всего один пункт в разделе, это Параметры.
en: As opposed to the server editions (Team, Standard, Enterprise), the desktop editions (Community, Personal) include only one section option - Parameters.

source: В отличии от таблицы, принимаемой портом "Входной источник данных", элементы транзакций вспомогательных данных должны располагаться в строках, а не в столбцах.
en: As opposed to the table accepted by the "Input data source" port, the transaction items of the supplementary data must be located in strings but not in columns.

source: В панели иерархически фиксируются процессы и выполняющиеся в них узлы/подузлы, им присваиваются порядковые номера.
en: Processes and nodes/subnodes which are performed in them are hierarchically fixed on the panel. Sequence numbers were assigned to them.

source: В параметрах Десятичный разделитель, Разделитель даты и Разделитель времени в качестве значений по умолчанию используются локальные настройки.
en: Local settings are used as default values in the following parameters: Decimal separator, Date separator and Time separator.

source: В параметрах запуска пакетного выполнения указан конкретный узел, который будет выполняться (см.
en: The definite node that will be executed is specified in the batch processing launch parameters(refer to

source: В параметрах этого метода коэффициент увеличения задается в поле "фактор" напротив каждого уникального значения выбранного столбца исходной таблицы, также число записей для каждого уникального значения можно ввести вручную.
en: The increase coefficient is set in the "factor" field in the method parameters in front of each unique value of the selected column of the source table. The number of records for each unique value can be manually entered.

source: В параметре "Путь к файлу пакета" задать путь к Пакету, доступ к объектам которого необходимо получить;
en: set the path to the Package access to which objects it is required to receive in "Path to the package file" parameter;

source: В первом и втором случае применение входного набора данных не обязательно.
en: It is not obligatory to use the input data set in the first and second cases.

source: В первую очередь производится поиск и замена по точному совпадению со значениями, указанными в таблице замен.
en: First of all, replacement and search are performed by exact match with the values specified in the replacement table.

source: В поле Текст команды следует вводить команду следующим образом:
en: It is required to enter the command in the Command text field as follows:

source: В последнем столбце задаётся видимость поля в визуализаторе Таблица.
en: The field visibility is set in the last column in the Table visualizer.

source: В последним столбце Версия содержится номер версии (типа X.X.X или X.X.X.Y, где X.X.X – номер версии, а Y – номер сборки).
en: The last Version column contains information on the version number (for example, X.X.X or X.X.X.Y where X.X.X is a version number, and Y is a build number).

source: В последующем, в узле вызова REST-сервиса этим параметрам задаются значения и формируется текст запроса.
en: Subsequently, values are set for these parameters and the request text is generated in the node used for REST service calling.

source: В появившемся диалоговом окне будут следующие поля:
en: The following fields will be available in the appeared dialog window:

source: В появившемся диалоговом окне необходимо заполнить поля:
en: It is possible to fill in the following fields in the appeared dialog window:

source: В появившемся окне содержится информация о приложении, включая номер версии (типа Версия файла: X.X.X.Y, где X.X.X – номер версии, а Y – номер сборки).
en: The appeared window contains information on the application, including version number (for example, file version: X.X.X.Y where X.X.X is a version number, and Y is a build number).

source: В появившийся порт подключается таблица с данными о входящих диапазонах.
en: The table with the data on the included ranges is connected to the appeared port.

source: В правой таблице выбрать нужный параметр запроса и в столбце Связанные поля выбрать из выпадающего списка метку поля из входного набора;
en: It is necessary to select the required request parameter in the right table and select the field caption from the input data set from the drop-down list in the Related fields column.

source: В правой таблице выбрать нужный элемент схемы XML и в столбце Связанные поля выбрать из выпадающего списка метку поля входной таблицы.
en: It is necessary to select the required item of the XML schema in the right table and select the input table field caption from the drop-down list in the Related fields column.

source: В правом верхнем углу окна будет указано общее количество столбцов в наборе данных (см.
en: The total count of columns in the data set will be shown in the right upper window corner (refer to

source: В предельном случае количество итераций равно количеству строк входного набора.
en: In the limiting case, iteration count is equal to row count of the input data set.

source: В продуктах прошлого поколения (Deductor) публикация веб-сервисов осуществлялась DIS (Deductor Integration Server), а обращение к веб-сервисам DIS из сценариев Deductor осуществлялось при помощи узла WEB-сервис.
en: Web services were published using DIS (Deductor Integration Server), DIS web services were accessed from the Deductor workflows using WEB service node in the past generation products (Deductor).

source: В производных компонентах реализуется механизм наследования, преимуществом которого является то, что он позволяет модифицировать созданный пользователем универсальный компонент лишь в одном месте — в библиотеке функций, и эти изменения автоматически произойдут во всех сценариях, где он применяется.
en: The inheritance mechanism is executed in the derived components. Its advantage is its ability to modify the universal component created by a user only in one place - in the library of functions. These changes will be automatically introduced in all workflows where it is used.

source: В простейшем случае сценарий импортирует данные из внешних источников, либо преобразовывает их и экспортирует (выводит в отчет).
en: In the simplest case the workflow will import the data from the external sources, or it will transform them and export (send to report).

source: В противном случае возвращается false.
en: Otherwise, the false value returns.

source: В противном случае проверка ответа веб-сервиса производится в упрощенном, ускоренном режиме, и большинство проверок осуществляются только для элементов XML, которые были выбраны для вывода в результирующем наборе данных.
en: Otherwise, the web service response is checked in the simplified accelerated mode. And most checks are performed only for the XML elements that have been selected for displaying in the resulting data set.

source: В противном случае проверка производится в упрощенном, ускоренном режиме.
en: Otherwise, the check is performed in the simplified accelerated mode.

source: В противном случае скрипт будет выполнен, но результат не будет выведен в вычисляемое поле.
en: Otherwise, the script will be executed but the result will not be shown in the calculated field.

source: В противном случае сообщение не выводится.
en: Otherwise, the message is not shown.

source: В противном случае эта информация выводится только для первого дочернего элемента.
en: Otherwise, this information is displayed only for the first child element.

source: В процентах.
en: In percents.

source: В процессе обучения нейронная сеть способна выявлять сложные зависимости между входными параметрами и выходными, а также выполнять обобщение.
en: In the process of training, the neural network enables to detect complex dependences between input and output parameters, and also to perform generalization.

source: В рамках стратегии декомпозиции сложного аналитического решения, которое может состоять из нескольких Сценариев или Пакетов, выполняет задачу передачи данных между его независимыми блоками.
en: According to the strategy of decomposition of the complex analytic solution that can consist of several Workflows or Packages, it performs the task of data transfer between its independent blocks.

source: В расчетах участвуют те поля, которые не пустые, и не <null>.| | Медиана||•|•||||Выводит значение медианы по столбцу.
en: The fields that are not empty and <null> are included into calculations.| | Median||•|•||||It shows the median value by column.

source: В редакторе кода поддерживаются следующие горячие клавиши:
en: The following hotkeys are supported in the code editor:

source: В редакциях Enterprise, Standard и Team (включающих в комплект поставки сервер Loginom) все пользовательские файлы хранятся на сервере Loginom.
en: All user files are kept on the Loginom server in the Enterprise, Standard and Team editions (the Loginom server is included into the supply package).

source: В режиме редактирования (отладки) Сценариев для каждого из узлов можно задать следующие варианты выполнения:
en: The following execution options can be set for each of the nodes in the Workflows editing (debugging) mode:

source: В результате будет получен набор данных, где в одном поле будет содержаться значение, соответствующее текущему отсчету (оно будет иметь то же имя, что и в исходном наборе), а слева и справа от него будут расположены поля со значениями, смещенными от текущего отсчета в прошлое и в будущее соответственно.
en: In the result, the data set will be obtained. Its field will contain the value that complies with the current lag (it will have the same name as in the source data set). The fields with the values moved to the past and to the future from the current lag correspondingly will be located to the left and to the right of it.

source: В результате будет сформирован следующий запрос:
en: Consequently, the following query will be generated:

source: В результате в левой части экрана в виде дерева отобразится перечень возможных для создания подключений (см.
en: In the result, a list of connections that can be created will be displayed in the left part of the screen in the form of a tree (refer to

source: В результате каждое исходное значение признака заменяется на метку интервала квантования, в который данное значение попало.
en: In the result, each source indicator value is replaced with the caption of the binning range with which this value complies.

source: В результате максимизируется нагрузка на каждый фактор относительно небольшого числа переменных, а факторные нагрузки остальных переменных минимизируются.
en: In the result, the loading on each factor with respect to relatively small number of variables is maximized, and factor loadings of other variables is minimized.

source: В результате обработки формируются новые данные, которые поступают в выходной порт.
en: In the result of the processing, the new data supplied to the output port is generated.

source: В результирующем наборе данные сопоставленных полей объединяются в одно поле.
en: The data of the mapped fields is joined into one field in the resulting data set.

source: В результирующем наборе присутствуют поля только основного набора.
en: There are only fields of the main data set in the resulting data set.

source: В результирующем сценарии добавляется узел экспорта и/или настраивается Визуализатор результатов (см.
en: The export node is added to the resulting workflow, and/or the Visualizer of results is configured (refer to

source: В результирующий набор добавляются следующие записи:
en: The following records are added to the resulting data set:

source: В результирующий набор попадают все записи главной таблицы , они дополняются полями из присоединяемой таблицы, при этом если для записи из главной таблицы не было найдено совпадения по ключевым полям, то добавляемые поля заполняются значением Null.
en: All records of the main table fall within the resulting data set. They are appended with the fields from the joined table. If no mapping was detected by the key fields for the record from the main table, the Null value is stated in the appended fields.

source: В результирующий набор попадают все записи присоединяемой таблицы , они дополняются полями из главной таблицы, при этом если для записи из присоединяемой таблицы не было найдено совпадения по ключевым полям, то добавляемые поля заполняются значением Null.
en: All records of the joined table fall within the resulting data set. They are appended with the fields from the main table. If no mapping was detected by the key fields for the record from the joined table, the Null value is stated in the appended fields.

source: В результирующий набор попадают правила, удовлетворяющие следующим условиям:
en: The rules meeting the following requirements are included into the resulting data set:

source: В ряде обработчиков, таких как Сортировка, Экспорт в текстовый файл и др.
en: In such handlers as Sorting, Export to the text file etc.

source: В связи с этим сортировка таблицы замен может влиять на результат обработки.
en: Thus, table sorting can have an impact on the processing result.

source: В связи с этим неверная позиция в списке может приводить к ошибке.
en: Consequently, incorrect list item position can cause a mistake.

source: В связи с этим порты публикуемых узлов необходимо настроить одним из способов:
en: Consequently, ports of the published nodes must be configured using one of the following methods:

source: В серверной версии путь указывается от корневого каталога.
en: The path is specified from the root directory in the server edition.

source: В серверных версиях доступ в раздел имеют только пользователи с ролью Администратор.
en: Only users with Administrator role have access to the section in the server editions.

source: В случае включенного параметра и небольшого таймаута, связь после разрыва соединения может не восстановиться.|
en: In the case of the enabled parameter or small timeout, it can be impossible to reestablish connection after the connection loss.|

source: В случае выбора Не заменять, к значениям не попавшим в Таблицу замен не применяется дополнительная обработка.
en: When Do not replace option is selected, the values not included into the Replacement table are not subject to the additional processing.

source: В случае изменения настроек входных/выходных портов (например, количество или имена полей/переменных) опубликованного ранее узла, необходимо обновить публикацию пакета, в котором этот узел содержиться.
en: If the settings of the input/output ports are changed (for example, the number or names of fields/variables) of the node that has been published earlier, it is required to update publication of the package which includes this node.

source: В случае использования SASL аутентификации, для логина используется введенное имя пользователя, а не полное доменное имя.
en: If the SASL authentification is used, the entered username is used as login but not the full domain name.

source: В случае некорректного отключения клиента сессия на сервере продолжает существовать до тех пор, пока не завершится timeout.
en: If the client is disabled incorrectly, the server session still exists until timeout is completed.

source: В случае отправки GET-запросов, каждая строка входного набора должна содержать параметры GET-запроса, а при POST-запросах — тело HTTP-запроса.
en: If GET requests are sent, each row of the input data set must contain the GET request parameters, and in the case of POST requests, the HTTP request body must be provided.

source: В случае с REST-сервисом для каждого из публикуемых пакетов создается конечная точка REST-сервиса.
en: In the case of REST service, the REST service endpoint is created for each of the published packages.

source: В случае успешной Аутентификации пользователя через LDAP и отсутствия данного пользователя в списке пользователей Loginom сервера, он создается автоматически.
en: If the user Authentification by means of LDAP is successful, and this user is not included into the list of the Loginom server users, it is automatically created.

source: В случае, если для режима активации подчиненными узлами используются настройки по умолчанию (Собственный режим активации узла = "Определяется контекстом текущего процесса обработки"), переобучение выполняется для всех подчиненных узлов вне зависимости от глубины вложенности.
en: If the default settings are used by the subordinate nodes for the activation mode (Specified mode of node activation = "Defined by the context of the current processing process"), the retraining is performed for all subordinate nodes irrespective of the nesting depth.

source: В случае, если используется многопользовательский доступ к БД, рекомендуется использовать сервер Firebird для избежания блокировок доступа.
en: In the case of the multiple user access to the DB, it is recommended to use the Firebird server to avoid access lock.

source: В случае, если их недостаточно, весь перечень доступен с помощью операции Настройка показателей.
en: But if that's not enough, whole list is available via Configure indicators operation.

source: В случае, если количество групп не кратно количеству строк в исходном наборе, в некоторых группах количество строк будет отличаться, и они будут равномерно распределены среди остальных групп.
en: If the count of groups is not in multiples of the row count in the source data set, the row count will be different in some groups, and they will be uniformly distributed among other groups.

source: В случае, если настраивается входной порт принимающий табличные данные, список "Выходные" отображает назначение полей набора данных, подаваемого на обработку алгоритмом узла.
en: If it is required to configure the input port that accepts the table data, the "Output" list displays the usage type of the data set fields of the node supplied for processing by the algorithm.

source: В случае, если с учетом интервала будут найдены несколько совпадений, то применяться будет наиболее близкое к исходному.
en: If several matches are found taking into account the interval, the closest match to the source one will be used.

source: В случае, если строку можно привести к числу (например, "0" или "7"), то приводится следующим образом: "0" — к логическому FALSE, а все остальные — к логическому TRUE.
en: If it is possible to set the string to the number (for example, "0" or "7"), it is set in the following way: "0" — to logical FALSE, and all the rest — to logical TRUE.

source: В случае, если структура входных данных, подаваемых в порт, еще неизвестна (например, если к входному порту связь не установлена), то интерфейс настройки порта предоставляет возможность задать только структуру выходных данных порта.
en: If the structure of the input data supplied to the port is still unknown (for example, if there is no link established with the input port), the port congiguration interface provides an opportunity to set only the structure of the output data of the port.

source: В случае, если таких узлов в пакете несколько и публикуется несколько пакетов, то для каждого из таких узлов создается соответствующий ему метод SOAP-сервиса и операция REST-сервиса.
en: If the package contains several such nodes and several packages are published, the SOAP service method and REST service operation are created for each of such nodes providing that it complies with it.

source: В случае, когда имена переменных из разных наборов совпадают, в выходном наборе имена таких переменных будут дополнены уникальными номерами.
en: If names of the variables from different sets coincide, names of such variables in the output data set will be supplemented by unique numbers.

source: В соответствии с заданной пропорцией данные случайным образом разделяются на обучающее и валидационное множество.
en: According to the set proportion the data is randomly divided into the training and validation sets.

source: В соответствии с заданными ему условиями выполняется только одна ветвь сценария и блокируется выполнение всех остальных.
en: Only one workflow branch is executed according to the given conditions, and execution of other branches is locked.

source: В состав Подмодели могут также включаться другие Подмодели, их вложенность друг в друга не ограниченна.
en: The Supernode can include other Supernodes, their nesting into each other is not restricted.

source: В состав подмодели могут также включаться и другие подмодели.
en: The supernode can also include other supernodes.

source: В списке "Входные" отображаются поля/переменные принятого портом набора данных (входного набора порта), которые следует сопоставить с полями/переменными выходного набора порта, представленными в списке "Выходные".
en: The "Input" list displays fields/variables of the data set accepted by the port (the input data set of the port). It is required to map them with fields/variables of the output data set of the port represented in the "Output" list.

source: В списке Входное дерево отображаются поля принятого портом набора данных, которые следует сопоставить с полями набора, подаваемого портом на обработку — Выходное дерево (подробнее см.
en: The Input Tree list displays fields of the data set accepted by the port. It is required to map them with fields of the data set supplied by the port for processing - Output Tree (refer to

source: В списке выводятся доступные источники данных ODBC.
en: The available ODBC data sources are listed.

source: В столбце Доступные поля показаны доступные для изменения формата поля с типами данных.
en: The fields with data types which format can be changed are displayed in the Available fields column.

source: В столбце Формат для выбранного поля можно выбрать формат отображения.
en: It is possible to select the display format in the Format column for the selected field.

source: В столбце Ширина для выбранного поля можно задать ширину столбца, отображаемого в Таблице.
en: It is possible to set width of the column displayed in the Table in Width column for the selected field.

source: В столбце могут содержаться все вышеперечисленные типы данных.
en: All data types listed above can be included into the column.

source: В столбце № указан порядковый номер поля исходного набора данных.
en: The field order number of the source data set is specified in column №.

source: В столбцы
en: To columns

source: В строке, задающей новое значение, символы $1 будут заменены на исходное значение.
en: $1 characters will be replaced with the source value in the row that enables to set the new value.

source: В строки
en: To strings

source: В таблице необходимо выбрать ряды для анализа взаимосвязи.
en: It is possible to select the series in the table to analyze interconnection.

source: В таблице ниже представлены функции агрегации:
en: The following aggregation functions are listed in the table below:
